
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	 
	//  //Движения.Управленческий.Записывать = Истина;
	//Регистр Управленческий
	//Первая проводка: Д 62(Дебиторская задолженность) - К 90 (Капитал) Розничная сумма
	//  //Движение = Движения.Управленческий.Добавить();
	//  //Движение.СчетДт = ПланыСчетов.Основной.ДебиторскаяЗадолженность;
	//  //Движение.СчетКт = ПланыСчетов.Основной.Капитал;
	//  //Движение.Период = Дата;
	//  //Движение.Сумма = ТекСтрокаПереченьНоменклатуры.сумма;
	//  //Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Клиенты] = Клиент;
	//Вторая проводка: Д 90 (капитал) - К 41 (товары) - себестоимость
	//  //Движение = Движения.Управленческий.Добавить();
	//  //Движение.СчетДт = ПланыСчетов.Основной.Капитал;
	//  //Движение.СчетКт = ПланыСчетов.Основной.Товары;
	//  //Движение.Период = Дата;
	//  //Движение.сумма = ТекСтрокаПереченьНоменклатуры.сумма;
	//  //Движение.КоличествоКт = ТекСтрокаПереченьНоменклатуры.Количество;
	
	//  //Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Материалы] = ТекСтрокаПерерченьНоменклатуры.номенклатура;
	
	// регистр СтоимостьМатериалов
	Движения.СтоимостьМатериалов.Записывать = Истина;
	Для Каждого ТекСтрокаПереченьНоменклатуры Из ПереченьНоменклатуры Цикл
		Движение = Движения.СтоимостьМатериалов.Добавить();
		Движение.Период = Дата;
		Движение.Материал = ТекСтрокаПереченьНоменклатуры.Номенклатура;
		Движение.Стоимость = ТекСтрокаПереченьНоменклатуры.Стоимость;
	КонецЦикла;
	Движения.Продажи.Записывать = истина;
	Для Каждого ТекСтрокаПереченьНоменклатуры Из ПереченьНоменклатуры Цикл
		
		// Регистр Продажи
		Движение = Движения.Продажи.Добавить();
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаПереченьНоменклатуры.Номенклатура;
		Движение.Клиент = Клиент;
		Движение.Мастер = Мастер;
		Движение.Количество = ТекСтрокаПереченьНоменклатуры.Количество;
		Движение.Выручка = ТекСтрокаПереченьНоменклатуры.Сумма;
		Движение.Стоимость = ТекСтрокаПереченьНоменклатуры.Стоимость * ТекСтрокаПереченьНоменклатуры.Количество;
	КонецЦикла;
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
